//소개 더미 데이터
List<String> generateIntroductions() {
  return [
    '안녕하세요. 노원 상계역 3분거리 역세권 노원 테니스장입니다.🎾\n'
        '처음 시작하시는 분들도 빌려드릴 수 있는 라켓과 공이 준비되어있습니다.🔥\n'
        '오전 7시부터 오후 11시까지 회사원들도 이용하실 수 있게 긴 영업시간으로\n'
        '많은 이용 부탁드립니다.❤️❤️❤️\n\n'
        '노원 테니스장 10월 이벤트 😁\n\n'
        '☝️ 첫 등록시 PT 10% 할인!!\n'
        '✌️ 라켓과 공을 구매시 20% 할인!!\n'
        '👏 주차장 무료이용!!\n'
        '👍 물품보관소 무료이용!! \n'
        '다양한 이벤트가 매월 준비되오니 많은 관심 부탁드립니다!!',

    '안녕하세요. 포천 송우리에서 테니스를 만나보세요!\n'
        '테니스 라켓은 대여 해드립니다.🌟\n'
        '저녁 8시부터 밤 12시까지 운영하므로, 바쁜 일정 속에서도 퇴근하시고 와주시면됩니다.\n\n'
        '9월 특별 이벤트 🎉:\n'
        '따로 없습니다.\n',

    '환영합니다! 강남구에 위치한 프리미엄 헬스클럽입니다.💪\n'
        '최신 장비와 넓은 공간에서 편안하게 운동할 수 있습니다.🌟\n'
        '아침 6시부터 밤 12시까지 운영하므로, 바쁜 일정 속에서도 운동할 시간을 찾을 수 있습니다.💖\n\n'
        '9월 특별 이벤트 🎉:\n'
        '신규 회원 등록 시 3개월 회원권 20% 할인!\n'
        '모든 운동복 및 운동 장비 10% 할인 판매!\n'
        '친구와 함께 등록 시, 두 사람 모두에게 추가 5% 할인!\n',

    '여러분을 위한 최고의 피트니스 센터, 마포 휘트니스 클럽을 소개합니다!🌟\n'
        '개인 맞춤 트레이닝과 다양한 그룹 클래스가 준비되어 있습니다.🏋️‍♂️\n'
        '스트레스 해소와 건강 증진을 위해 최고의 트레이너들이 여러분을 기다리고 있습니다.❤️\n\n'
        '이달의 이벤트 🎊:\n'
        '첫 방문 시 무료 체험 제공!\n'
        '프리미엄 멤버십 가입 시, 스파 및 사우나 무료 이용!\n',

    '부산 서면 최고의 헬스클럽! 신체와 마음의 균형을 찾아드립니다.🧘‍♀️\n'
        '최상의 시설에서 요가, 필라테스, 스피닝 등 다양한 수업을 즐겨보세요.🚴‍♀️\n'
        '새벽 5시부터 자정까지 운영하니, 여러분의 라이프스타일에 맞게 운동하세요.🌙\n\n'
        '10월 한정 프로모션 🏷️:\n'
        '6개월 이상 회원권 구매 시, 개인 트레이닝 세션 2회 무료 제공!\n'
        '모든 신규 회원에게 웰컴 키트 증정!\n',

    '인천 최대규모의 헬스장, 더 짐에서 여러분을 초대합니다!🎈\n'
        '전문가와 함께하는 건강 관리를 경험하고 싶다면 지금 바로 방문해보세요.👟\n'
        '다양한 장비와 프로그램을 제공하여 모든 운동 목표를 달성할 수 있도록 돕습니다.🏆\n\n'
        '특별 이벤트 🎁:\n'
        '가족 회원 가입 시, 전원 수영장 및 피트니스 클래스 무료 이용 기회 제공!\n'
        '멤버십 갱신 시, 마사지 서비스 30% 할인 쿠폰 증정!\n',

    '헬스와 휴식을 한 번에! 청담동 럭셔리 피트니스 클럽에서 최고급 서비스를 경험하세요.🌿\n'
        '전문적인 운동 시설과 함께, 휴식과 재충전을 위한 스파 서비스도 제공합니다.🛁\n'
        '오전 6시부터 밤 10시까지 운영합니다. 일과 후에도 충분히 운동할 수 있어요.🌆\n\n'
        '11월 프로모션 🌟:\n'
        '신규 가입 회원 전원에게 첫 달 50% 할인!\n'
        '스파 패키지 회원가입 시, 추가 10% 할인 혜택!\n',
  ];
}
